NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFM32GG11B/EFM32GG11B310F2048GQ100.svd
        <register>
          <name>SCANINPUTSEL</name>
          <description>Input Selection Register for Scan Mode</description>
          <addressOffset>0x024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1F1F1F1F</resetMask>
          <fields>
            <field>
              <name>INPUT0TO7SEL</name>
              <description>Inputs Chosen for ADCn_INPUT7-ADCn_INPUT0 as Referred in SCANMASK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APORT0CH0TO7</name>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT0CH8TO15</name>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1CH0TO7</name>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1CH8TO15</name>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1CH16TO23</name>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1CH24TO31</name>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2CH0TO7</name>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2CH8TO15</name>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2CH16TO23</name>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2CH24TO31</name>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3CH0TO7</name>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3CH8TO15</name>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3CH16TO23</name>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3CH24TO31</name>
                  <value>0x0000000F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4CH0TO7</name>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4CH8TO15</name>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4CH16TO23</name>
                  <value>0x00000012</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4CH24TO31</name>
                  <value>0x00000013</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPUT8TO15SEL</name>
              <description>Inputs Chosen for ADCn_INPUT8-ADCn_INPUT15 as Referred in SCANMASK</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APORT0CH0TO7</name>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT0CH8TO15</name>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1CH0TO7</name>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1CH8TO15</name>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1CH16TO23</name>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1CH24TO31</name>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2CH0TO7</name>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2CH8TO15</name>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2CH16TO23</name>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2CH24TO31</name>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3CH0TO7</name>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3CH8TO15</name>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3CH16TO23</name>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3CH24TO31</name>
                  <value>0x0000000F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4CH0TO7</name>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4CH8TO15</name>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4CH16TO23</name>
                  <value>0x00000012</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4CH24TO31</name>
                  <value>0x00000013</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPUT16TO23SEL</name>
              <description>Inputs Chosen for ADCn_INPUT16-ADCn_INPUT23 as Referred in SCANMASK</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APORT0CH0TO7</name>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT0CH8TO15</name>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1CH0TO7</name>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1CH8TO15</name>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1CH16TO23</name>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1CH24TO31</name>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2CH0TO7</name>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2CH8TO15</name>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2CH16TO23</name>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2CH24TO31</name>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3CH0TO7</name>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3CH8TO15</name>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3CH16TO23</name>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3CH24TO31</name>
                  <value>0x0000000F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4CH0TO7</name>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4CH8TO15</name>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4CH16TO23</name>
                  <value>0x00000012</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4CH24TO31</name>
                  <value>0x00000013</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPUT24TO31SEL</name>
              <description>Inputs Chosen for ADCn_INPUT24-ADCn_INPUT31 as Referred in SCANMASK</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APORT0CH0TO7</name>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT0CH8TO15</name>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1CH0TO7</name>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1CH8TO15</name>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1CH16TO23</name>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1CH24TO31</name>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2CH0TO7</name>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2CH8TO15</name>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2CH16TO23</name>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2CH24TO31</name>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3CH0TO7</name>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3CH8TO15</name>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3CH16TO23</name>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3CH24TO31</name>
                  <value>0x0000000F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4CH0TO7</name>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4CH8TO15</name>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4CH16TO23</name>
                  <value>0x00000012</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT4CH24TO31</name>
                  <value>0x00000013</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
